// pages/OfflineActivity/Activity/Activity.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: [
      {
        id: '1',
        img: '/img/zhenzhou.jpg',
        name: '春季大型人才招聘会',
        city: '郑州',
        time: '2018-03-04 09：00-12：00',
        much: '500家企业',
        post: '11786个',
        place: '河南人才市场河南人才市场河南人才市场河南人才市场'
      }
    ],
    service: [
      {
        content: '免费诊断简历、免费职业规划、免费职业测评'
      }
    ],
    activ: [
      {
        content: '免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评免费诊断简历、免费职业规划、免费职业测评'
      }
    ],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})